In [1]:
import pandas as pd

In [2]:
df= pd.read_csv("raw_data.csv")

In [3]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [4]:
df.isnull()

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

In [5]:
df.isnull().sum()
df.dropna()
age=df["age"].mean()

df["age"].fillna(age)

0     29.00
1     29.00
2     32.75
3     32.75
4     34.00
5     27.00
6     45.00
7     38.00
8     29.00
9     32.75
10    31.00
Name: age, dtype: float64

In [6]:
df.duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [7]:
df["gender"].str.capitalize()

0        Male
1        Male
2      Female
3     Unknown
4      Female
5        Male
6      Female
7        Male
8      Female
9        Male
10        NaN
Name: gender, dtype: object

In [8]:
df["name"].str.split(",")

0         [John Doe]
1         [John Doe]
2       [Jane Smith]
3             [Alex]
4     [Maria Garcia]
5           [Li Wei]
6                NaN
7       [Ahmed Khan]
8       [Rachel Lee]
9      [Carlos Ruiz]
10     [Emily Davis]
Name: name, dtype: object

In [9]:
df["country"].str.contains("india",case=False)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7       NaN
8     False
9     False
10    False
Name: country, dtype: object

In [27]:
df2=df.copy()
df2["tax"]=df2["income"].apply(lambda x:"12%" if x>= 60000 else "10%")
gender_map={
    "Male":"M",
    "Female":"f",
    "Unknown":"U"
}
df2["gender"] =df2["gender"].map(gender_map)
df2=df2.assign(new_income=df2["income"]*1.1)
df2["sat"]=df2["income"].apply(lambda x : x-x*0.12 if x>=60000 else x-x*0.10)
df2

    id          name   age country gender   income  tax  new_income      sat
0    1      John Doe  29.0     USA      M  55000.0  10%     60500.0  49500.0
1    1      John Doe  29.0     USA      M  55000.0  10%     60500.0  49500.0
2    2    Jane Smith   NaN  Canada      f  62000.0  12%     68200.0  54560.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0  42300.0
4    4  Maria Garcia  34.0   Spain      f      NaN  10%         NaN      NaN
5    5        Li Wei  27.0   China      M  51000.0  10%     56100.0  45900.0
6    6           NaN  45.0   India      f  73000.0  12%     80300.0  64240.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  12%     74800.0  59840.0
8    8    Rachel Lee  29.0     USA      f  62000.0  12%     68200.0  54560.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0  40500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  10%     63800.0  52200.0

In [42]:
sorted_df=df2.sort_values("income",ascending=False)
sorted_df
sorted_df.reset_index()
sorted_df["rank"]=sorted_df["income"].rank(ascending=False,method="dense")
sorted_df

,id,name,age,country,gender,income,tax,new_income,sat,rank
6,6,NaN,45.0,India,f,73000.0,12%,80300.0,64240.0,1.0
7,7,Ahmed Khan,38.0,NaN,M,68000.0,12%,74800.0,59840.0,2.0
2,2,Jane Smith,NaN,Canada,f,62000.0,12%,68200.0,54560.0,3.0
8,8,Rachel Lee,29.0,USA,f,62000.0,12%,68200.0,54560.0,3.0
10,10,Emily Davis,31.0,USA,NaN,58000.0,10%,63800.0,52200.0,4.0
0,1,John Doe,29.0,USA,M,55000.0,10%,60500.0,49500.0,5.0
1,1,John Doe,29.0,USA,M,55000.0,10%,60500.0,49500.0,5.0
5,5,Li Wei,27.0,China,M,51000.0,10%,56100.0,45900.0,6.0
3,3,Alex,NaN,USA,U,47000.0,10%,51700.0,42300.0,7.0
9,9,Carlos Ruiz,NaN,Mexico,M,45000.0,10%,49500.0,40500.0,8.0
4,4,Maria Garcia,34.0,Spain,f,NaN,10%,NaN,NaN,NaN

In [43]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [45]:
df[["name","age","country","gender","income","id"]]

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

In [ ]:
df2=df.copy()
df2.fillna(100)
df2=df2.sort_values("income")
df2=df2.reset_index(drop=True)
df2.to_csv("sorted_csv")

    id          name   age country   gender   income
0    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
1    3          Alex   NaN     USA  Unknown  47000.0
2    5        Li Wei  27.0   China     Male  51000.0
3    1      John Doe  29.0     USA     Male  55000.0
4    1      John Doe  29.0     USA     Male  55000.0
5   10   Emily Davis  31.0     USA      NaN  58000.0
6    2    Jane Smith   NaN  Canada   Female  62000.0
7    8    Rachel Lee  29.0     USA   Female  62000.0
8    7    Ahmed Khan  38.0     NaN     Male  68000.0
9    6           NaN  45.0   India   Female  73000.0
10   4  Maria Garcia  34.0   Spain   Female      NaN